; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-63)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b4)
    (on b4 b9)
    (on b9 b2)
    (on b2 b1)
    (on b1 b19)
    (on b19 b18)
    (on b18 b12)
    (on-table b12)
    (clear b15)
    (on b15 b5)
    (on-table b5)
    (clear b17)
    (on b17 b8)
    (on b8 b13)
    (on b13 b6)
    (on b6 b11)
    (on b11 b10)
    (on b10 b16)
    (on b16 b3)
    (on b3 b7)
    (on-table b7))
 (:goal (and 
(on b9 b18)
))
)

; plan
1. (unstack b14 b4)
   deleted: (on b14 b4) (clear b14) (arm-empty)
   added: (holding b14) (clear b4)
   goals met: 0 of 1
2. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
3. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 0 of 1
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
5. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 0 of 1
6. (stack b9 b14)
   deleted: (clear b14) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b14)
   goals met: 0 of 1
7. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 0 of 1
8. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
9. (unstack b1 b19)
   deleted: (on b1 b19) (clear b1) (arm-empty)
   added: (holding b1) (clear b19)
   goals met: 0 of 1
10. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
11. (unstack b19 b18)
   deleted: (on b19 b18) (clear b19) (arm-empty)
   added: (holding b19) (clear b18)
   goals met: 0 of 1
12. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
13. (unstack b9 b14)
   deleted: (on b9 b14) (clear b9) (arm-empty)
   added: (holding b9) (clear b14)
   goals met: 0 of 1
14. (stack b9 b18)
   deleted: (clear b18) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b18)
   goals met: 1 of 1
